/* 
 
 稀疏数组：数组有长度但是全为空或者某几项为空。稀疏也就是说，数组中的元素之间可以有空隙
        let a = [, , , , , , ,];
        let b = [1, 2, , 3, 4, , , 5];

     以下操作会造成稀疏数组：
        
        var a = new Array(5); // 构造函数声明一个没有元素的数组 [empty × 5]
   
        var a = [];
        a[5] = 4; // 指定的索引值大于数组长度 [empty × 5, 4]

        var a = [];
        a.length = 5; // 指定大于元素个数的数组长度 [empty × 5]

        var a = [0, , , ,]; // 数组直接量中省略值 [0, empty × 3]

        var a = [0, 1, 2, 3, 4];
        delete a[4]; // 删除数组元素 [0, 1, 2, 3, empty]
  
  密集数组：      
        

*/
