/* 

    8个二进制位称为一个字节B 1B=8bit
    1kb = 1024B 千字节
    1MB = 1024KB 兆字节
    1GB = 1024MB 吉字节
    1TB = 1024GB 太字节
    1PB = 1024TB 拍字节
    1EB = 1024PB 艾字节
    1ZB = 1024EB 泽字节
    1YB = 1024ZB 尧字节
    1BB = 1024YB BB
    1NB = 1024BB NB
  
    通常说的运营商宽带速率实际上指的是带宽的速率 而不是数据量的速率
    带宽的单位是 兆比特每秒 Mbps b指的是Bit(位)
    网速单位是兆字节每秒MB/s B是指Byte(字节)
    1M宽带(1Mbps) 即 1*1024/8 = 128KB/sec

    100Mbps = 12.5MB/s
    200Mbps = 25MB/s
    300Mbps = 37.5MB/s

    如果安装的是100兆宽带 测速看到下载速率 12.5MB/s 是正常的。
    如果是200兆宽带 下载速率 12.5MB/s 则可能光猫 路由器 网卡中至少有一个是百兆的导致的，
    水桶效应。

    运营商宣传的几百兆宽带指的是下载速率[下行速率]，上传速率[上传速率]通常会大打折扣 
    经常100兆宽带 上传速率只有5M，上下行速率不对等。

    一般无线路由器通常提供5种工作模式：路由，AP，桥接，中继，客户端

*/
